Revit 2026 API

# SpatialElementGeometryResults Class

---

The results of spatial element geometry calculation.

SystemObject Autodesk.Revit.DBSpatialElementGeometryResults

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementGeometryResults : IDisposable
```
```vb
Public Class SpatialElementGeometryResults
	Implements IDisposable
```
```cpp
public ref class SpatialElementGeometryResults : IDisposable
```
```fsharp
type SpatialElementGeometryResults =
    class
        interface IDisposable
    end
```

The SpatialElementGeometryResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SpatialElementGeometryResults |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundaryFaceInfo | Query the spatial element boundary face information with the given face. |
|  | GetGeometry | The solid from the spatial element. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The subfaces of a SpatialElement at the base height and top height are not associated with floors, roofs, and ceilings at the same height.

#### Reference

Autodesk.Revit.DB Namespace